app/controllers/movies_controller.rb

SELECT "actors".* FROM "actors" WHERE "actors"."movie_id" IN (?, ?, ?, ?, ?, ?, ?, ?)  [["movie_id", 1], ["movie_id", 2], ["movie_id", 3], ["movie_id", 4], ["movie_id", 5], ["movie_id", 6], ["movie_id", 7], ["movie_id", 8]]
SELECT "directors".* FROM "directors" WHERE "directors"."movie_id" IN (?, ?, ?, ?, ?, ?, ?, ?)  [["movie_id", 1], ["movie_id", 2], ["movie_id", 3], ["movie_id", 4], ["movie_id", 5], ["movie_id", 6], ["movie_id", 7], ["movie_id", 8]]
SELECT "movies".* FROM "movies"
---
    def index
        movies = Movie.all.includes(:actors, :directors)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      def show
        movie = Movie.find(params[:id])

SELECT "actors".* FROM "actors" WHERE "actors"."movie_id" = ?  [["movie_id", 1]]
SELECT "directors".* FROM "directors" WHERE "directors"."movie_id" = ?  [["movie_id", 1]]
INSERT INTO "movies" ("name", "description", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
SELECT "actors".* FROM "actors" WHERE "actors"."movie_id" = ?  [["movie_id", 8]]
INSERT INTO "actors" ("name", "age", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Tim Robbins"], ["age", 62], ["movie_id", 8], ["created_at", "2023-03-29 06:47:10.532835"], ["updated_at", "2023-03-29 06:47:10.532835"]]
SELECT "directors".* FROM "directors" WHERE "directors"."movie_id" = ?  [["movie_id", 8]]
INSERT INTO "directors" ("name", "age", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Frank Darabont"], ["age", 62], ["movie_id", 8], ["created_at", "2023-03-29 06:47:10.545097"], ["updated_at", "2023-03-29 06:47:10.545097"]]
---
      def create
        movie_params = params.require(:movie).permit(:name, :description, :year)
        actor_params = params.require(:actors).map { |a| a.permit(:name, :age) }
        director_params = params.require(:directors).map { |d| d.permit(:name, :age) }

        movie = Movie.new(movie_params)
        if movie.save
          # create actors
          actor_params.each do |actor_param|
            actor = Actor.new(actor_param.merge(movie: movie))
            actor.save
          end

          # create directors
          director_params.each do |director_param|
            director = Director.new(director_param.merge(movie: movie))
            director.save

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 1]]
---
      def destroy
        movie = Movie.find(params[:id])
        movie.destroy