Movie_api/app/controllers/actors_controller.rb

  def create
    @actor = @movie.actors.new(actor_params)

    if @actor.save
---
INSERT INTO "actors" ("name", "age", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "The Matrix"], ["age", nil], ["movie_id", 2], ["created_at", "2023-03-31 08:10:20.141027"], ["updated_at", "2023-03-31 08:10:20.141027"]]

  def set_movie
    @movie = Movie.find(params[:movie_id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_actor
    @actor = @movie.actors.find(params[:id])
---
SELECT "actors".* FROM "actors" WHERE "actors"."movie_id" = ?  [["movie_id", 1]]