Movie_api/app/controllers/diractors_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_movie
      @movie = Movie.find(params[:movie_id])

SELECT "diractors".* FROM "diractors" WHERE "diractors"."movie_id" = ?  [["movie_id", 1]]
---
    def set_diractor
      @diractor = @movie.diractors.find(params[:id])