Movie_api/app/controllers/movies_controller.rb

  def create
    @movie = Movie.new(movie_params)

    if @movie.save
---
INSERT INTO "movies" ("name", "description", "image", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def set_movie
    @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]