Movie_api/app/controllers/reviews_controller.rb

    def set_movie
      @movie = Movie.find(params[:movie_id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def set_review
      @review = @movie.reviews.find(params[:id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]