Movie_api/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "cabdiraxman"], ["email", "cabdi@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-03-31 07:46:25.552484"], ["updated_at", "2023-03-31 07:46:25.552484"]]
---
  def create
    @user = User.new(user_params)

    if @user.save